'use strict';

/*
______________________

--- ГЛАВНЫЙ МОДУЛЬ ---
______________________

*/
window.main = (function () {

  /*
  ----------------------------------------------------------------------------------
  ---------------------- ВСПОМОГАТЕЛЬНЫЕ ПЕРЕМЕННЫЕ И ФУНКЦИИ ----------------------
  ----------------------------------------------------------------------------------
  */

  // ********* DOM-элементы *********
  var FORM_UPLOAD_IMAGE = document.querySelector('#upload-select-image'); // --- Форма загрузки и редактирования изображения
  var UPLOAD_FILE = FORM_UPLOAD_IMAGE.querySelector('#upload-file'); // --- Контрол загрузки нового изображения


  /*
  ----------------------------------------------------------------------------------
  --------------------------------- ОСНОВНАЯ ЛОГИКА --------------------------------
  ----------------------------------------------------------------------------------
  */


  // *** Обработчик события — Загрузка изображения на сайт ***
  UPLOAD_FILE.addEventListener('change', function () {
    window.imageEditingForm.open();
  });


  // *** Обработчик события — Закрытие Формы редактирования изображения ***
  window.imageEditingForm.exit.addEventListener('click', function () {
    window.imageEditingForm.close();
  });

})();
