'use strict';

/*
______________________

--- ГЛАВНЫЙ МОДУЛЬ ---
______________________

*/
window.main = (function () {

  /*
  ----------------------------------------------------------------------------------
  ---------------------- ВСПОМОГАТЕЛЬНЫЕ ПЕРЕМЕННЫЕ И ФУНКЦИИ ----------------------
  ----------------------------------------------------------------------------------
  */

  // ********* DOM-элементы *********
  var PICTURES_CONTAINER = document.querySelector('.pictures'); // --- Блок для отрисовки фотографий на страницу

  var FORM_UPLOAD_IMAGE = document.querySelector('#upload-select-image'); // --- Форма загрузки и редактирования изображения
  var UPLOAD_FILE = FORM_UPLOAD_IMAGE.querySelector('#upload-file'); // --- Контрол загрузки нового изображения


  /*
  ----------------------------------------------------------------------------------
  --------------------------------- ОСНОВНАЯ ЛОГИКА --------------------------------
  ----------------------------------------------------------------------------------
  */

  // *** Добавление обработчика события для показа Полноразмерной фотографии ***
  PICTURES_CONTAINER.addEventListener('click', window.bigPicture.onOpen);


  // *** Обработчик события — Загрузка изображения на сайт ***
  UPLOAD_FILE.addEventListener('change', function () {
    window.imageEditingForm.onOpen();
  });


  // *** Обработчик события — Закрытие Формы редактирования изображения ***
  window.imageEditingForm.IMAGE_EDITING_FORM_EXIT.addEventListener('click', function () {
    window.imageEditingForm.onClose();
  });

})();
