'use strict';

/*
______________________________________

--- ТЕСТОВЫЕ НАБОРЫ ДАННЫХ (МОКИ) ---
______________________________________

*/
window.mock = (function () {
  return {
    // --- Массив сообщений комментариев ---
    MESSAGES: [
      'Всё отлично!',
      'В целом, всё неплохо. Но не всё.',
      'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов, это просто непрофессионально.',
      'Моя бабушка случайно чихнула с фотоаппаратом в руках, и у неё получилась фотография лучше.',
      'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота, и у меня получилась фотография лучше.',
      'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?! '
    ],
    // --- Массив имён комментаторов ---
    NAMES: [
      'Мистер Великолепный',
      'Чудастер',
      '$erёЖ@',
      'Megaman',
      'Саня Гордый',
      'Mil@shka',
      'Ольга Павловна',
      'Виктор',
      'Мальвина'
    ],
    // --- Массив описаний для фотографий ---
    DESCRIPTIONS: [
      'Бюджетный «Майами Бич»',
      'Путь к морю',
      'Райское наслаждение',
      'Я в купальнике :ь',
      'Купание рисовых малышат',
      'Ауфф',
      'Азиатская диета',
      'М-м-м-морсик!',
      'Привет пилотам!',
      'Моя обувная полка',
      'Дорога к счастью',
      'Белая «Audi»',
      'ПП-завтрак',
      'Местный деликатес',
      'Космические башмачки B)',
      'А внизу горы...',
      'Национальный хор',
      'Американская классика',
      'Тапочки с фонариками',
      'Лакшери и Пальмы',
      'ПП-обед',
      'Романтическое купание',
      'Мистер Крабс :D:D:D',
      'Рок-эн-Ролл!',
      'Опасное сафари!'
    ]
  };

})();
